//=============================================================================
//
// CLightクラス [CLight.cpp]
// Author : 野尻　尚希
//
//=============================================================================
//*****************************************************************************
// インクルード
//*****************************************************************************
#include "CLight.h"
#include "../RENDERER/CRenderer.h"

//*****************************************************************************
// staticメンバ変数
//*****************************************************************************
CLight*		CLight ::m_apCLight[NUM_MAX_LIGHT];
int			CLight ::m_nCountCLight = 0;
//*****************************************************************************
// コンストラクタ
//*****************************************************************************
CLight ::CLight(void)
{
	m_nID = m_nCountCLight;
	m_nCountCLight++;

	// 自身を登録
	m_apCLight[m_nID] = this;
}

//*****************************************************************************
// デストラクタ
//*****************************************************************************
CLight ::~CLight(void)
{
}

//*****************************************************************************
// 初期化関数
//*****************************************************************************
void CLight :: Init(D3DXVECTOR3 dir, D3DXCOLOR color, _D3DLIGHTTYPE type, BOOL useFlag)
{
	LPDIRECT3DDEVICE9* pDevice = CRenderer ::GetDevice();

	// 初期化
	ZeroMemory(&m_Light, sizeof(D3DLIGHT9));
	
	// 光源のタイプ設定
	m_Light.Type = type;

	// 光の色
	m_Light.Diffuse = color;
	
	// 光の方向	
	// *******注意！！：スクリーンの座標系とは違って左手座標系なのでY軸は上がプラス ex)上から照らしたいならYはマイナス方向でないといけない************
	m_vecDir = dir;
	
	// 方向の正規化
	D3DXVec3Normalize((D3DXVECTOR3*)&m_Light.Direction, &m_vecDir);

	// セットする(設置)
	(*pDevice)->SetLight(m_nID, &m_Light);

	// ON,OFFの設定
	(*pDevice)->LightEnable(m_nID, useFlag);

	// ライティングするよ
	(*pDevice)->SetRenderState(D3DRS_LIGHTING,TRUE);
}

//*****************************************************************************
// 終了関数
//*****************************************************************************
void CLight ::Uninit(void)
{

}

//*****************************************************************************
// 更新関数
//*****************************************************************************
void CLight ::Update(void)
{

}

//----EOF----