//=============================================================================
//
// CGoalManagerクラス [CGoalManager.h]
// Author : 塚本　俊彦
//
// 宝物マネージャー　こいつを介して宝物を生成する
//
//=============================================================================
#ifndef _CGOALMANAGER_H_
#define _CGOALMANAGER_H_

//=============================================================================
// インクルード
//=============================================================================
#include "../../../RENDERER/CRenderer.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CGoal;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CGoalManager
{
	// 公開メンバ
public:
	CGoalManager(LPDIRECT3DDEVICE9 *pDevice);
	~CGoalManager(void);

	void Init(void);
	void Uninit(void);
	void Update(void);

	// ゴール生成関数
	void CreateGoal(D3DXVECTOR3 *pos, short *nPlayerNum, short nGoalNum);

	// 非公開メンバ
private:
	// ゴール
	CGoal *m_pGoal;

	// デバイス
	LPDIRECT3DDEVICE9 *m_pDevice;
};

#endif
//----EOF----