//=============================================================================
//
// CAttacjManagerクラス [CAttacjManager.h]
// Author : 塚本　俊彦
//
// 攻撃マネージャー
//
//=============================================================================
#ifndef _CATTACKMANAGER_H_
#define _CATTACKMANAGER_H_

//=============================================================================
// インクルード
//=============================================================================
#include "../../../RENDERER/CRenderer.h"

//=============================================================================
// 定数
//=============================================================================
enum AttackType{
	ATTACK_TYPE_NORMAL,
	ATTACK_TYPE_MAX
};

//=============================================================================
// 前方宣言
//=============================================================================
class CAttack;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CAttackManager
{
	// 公開メンバ
public:
	CAttackManager(LPDIRECT3DDEVICE9 *pDevice);
	~CAttackManager(void);

	void Init(void);
	void Uninit(void);
	void Update(void);

	// 攻撃を作る関数(攻撃タイプ,プレイヤ番号,座標,移動量（向きベクトル）)
	void CreateAttack(
		AttackType type,
		int nPlayerNum,
		D3DXVECTOR3 pos,
		D3DXVECTOR3 velocity);

	// 非公開メンバ
private:
	LPDIRECT3DDEVICE9 *m_pDevice;
};

#endif
//----EOF----