//=============================================================================
//
// CAttackBaseクラス [CAttackBase.h]
// Author : 塚本　俊彦
//
// 攻撃の基底クラス
//
//=============================================================================
#ifndef _CATTACKBASE_H_
#define _CATTACKBASE_H_

//=============================================================================
// インクルード
//=============================================================================
#include "../../CSCENE/CScene2D.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CAttackBase : public CScene2D
{
	// 公開メンバ
public:

	CAttackBase(LPDIRECT3DDEVICE9 *pDevice);
	~CAttackBase(void);

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	//=======================================================================
	// クリエイト関数
	// 引数:デバイス、座標、幅、高さ、テクスチャの種類
	// 戻り値:作成したアドレス
	//=======================================================================
	static CAttackBase *Create(
		LPDIRECT3DDEVICE9 *pDevice,
		D3DXVECTOR3 pos);

	// 非公開メンバ
private:

};

#endif
//----EOF----