//=============================================================================
//
// CTutorialクラス [CTutorial.h]
// Author : 塚本俊彦
//
//=============================================================================
#ifndef _CTUTORIAL_H_
#define _CTUTORIAL_H_
//*****************************************************************************
// インクルード
//*****************************************************************************
#include "../../MAIN/main.h"
#include "../../PHASE/CPhase.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene2D;

//*****************************************************************************
// 定数
//*****************************************************************************
const short TUTORIAL_PAGE_MAX = 4;
const short TUTORIAL_PICT_MAX = 3;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTutorial : public CPhase
{
public:
	// コンストラクタ
	CTutorial(void);

	// デストラクタ
	~CTutorial(void);

	//=================================================================
	// 初期化関数
	// 引数: シーンのモード, デバイス
	//=================================================================
	void Init(MODE_PHASE mode, LPDIRECT3DDEVICE9* pDevice);

	// 終了
	void Uninit(void);

	// 更新
	void Update(void);

	//=================================================================
	// クリエイト関数
	// 引数: シーンのモード, デバイス
	// 戻り値: このシーンのアドレス
	//=================================================================
	static CTutorial* Create(MODE_PHASE mode, LPDIRECT3DDEVICE9* pDevice);

private:

	// 背景
	CScene2D* m_pBackGround;

	// チュートリアルの絵
	CScene2D* m_p2D[TUTORIAL_PICT_MAX];

	// 絵の移動量
	D3DXVECTOR3 m_vVelo;
	
	// 左右どっちに動いてるのフラグ
	bool m_bRight;

	// ページ数
	short m_nPage;

};

#endif
//----EOF----