//=============================================================================
//
// CGoalクラス [CGoal.h]
// Author : 塚本　俊彦
//
// 宝物をここに運ぶ α版は絵だけ
//
//=============================================================================
#ifndef _CGOAL_H_
#define _CGOAL_H_

//=============================================================================
// インクルード
//=============================================================================
#include "../../../MAIN/main.h"
#include "../../CSCENE/CScene2D.h"

//=============================================================================
// 前方宣言
//=============================================================================

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CGoal : public CScene2D
{
	// 公開メンバ
public:

	CGoal(LPDIRECT3DDEVICE9 *pDevice);
	~CGoal(void);

	void Init(void);
	void Uninit(void);
	void Update(void);

	//=======================================================================
	// クリエイト関数
	// 引数:デバイス、座標、幅、高さ、テクスチャの種類
	// 戻り値:作成したアドレス
	//=======================================================================
	static CGoal *Create(
		LPDIRECT3DDEVICE9 *pDevice,
		D3DXVECTOR3 pos,
		short nPlayerNum);

	// 非公開メンバ
private:
	// 転送中フラグ
	bool m_bTranceFlg;
	// プレイヤー番号
	short m_nPlayerNum;

};

#endif
//----EOF----