//=============================================================================
//
// CCLightクラス [CCLight.h]
// Author : 野尻　尚希
//
//=============================================================================
#ifndef _CLIGHT_H_
#define _CLIGHT_H_
//*****************************************************************************
// インクルード
//*****************************************************************************
#include "../MAIN/main.h"

//*****************************************************************************
// マクロ
//*****************************************************************************
static const int NUM_MAX_LIGHT = 4;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CLight
{
public:
	// コンストラクタ
	CLight(void);

	// デストラクタ
	~CLight(void);

	//===========================================================================
	// 初期化
	// 引数: 方向、色、ライトのタイプ、使用するかどうか
	//===========================================================================
	void Init(D3DXVECTOR3 dir, D3DXCOLOR color, _D3DLIGHTTYPE type, BOOL useFlag);

	// 終了
	void Uninit(void);

	// 更新
	void Update(void);

private:
	D3DXVECTOR3			m_vecDir;					// 光の方向
	D3DXCOLOR			m_color;					// 色
	_D3DLIGHTTYPE		m_type;						// ライトのタイプ
	D3DLIGHT9			m_Light;					// ライトオブジェクト
	BOOL				m_bUse;						// 使うかどうか
	int					m_nID;						// ID
	static CLight*		m_apCLight[NUM_MAX_LIGHT];	// ライトの保存場所
	static int			m_nCountCLight;				// ライトの総数

};

#endif
//----EOF----