//=============================================================================
//
// CJudgeクラス [CJudge.h]
// Author : 野尻　尚希
//
//=============================================================================
#ifndef _CJUDGE_H_
#define _CJUDGE_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "../MAIN/main.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CJudge
{
public:
	// OBB情報構造体
	typedef struct
	{
		D3DXVECTOR2 pos;		// 中心の座標
		D3DXVECTOR2 axisX;		// 分離軸
		D3DXVECTOR2 axisY;		// 分離軸
		float		lengthX;	// 中心からの距離
		float		lengthY;	// 中心からの距離
	}OBB_INFO;

	// コンストラクタ
	CJudge(void){};

	// デストラクタ
	~CJudge(void){};

	// フィールドとプレイヤーのあたり判定
	void ColiFieldxPlayer(void);

private:
	//=========================================================================
	// 矩形と矩形のあたり判定
	// 引数:判定したいもののOBB情報
	// 戻り値：真偽
	//=========================================================================
	bool IsOBB(OBB_INFO& rectA, OBB_INFO& rectB);

	//=========================================================================
	// OBB情報作成関数
	// 引数:作成したOBB情報入れるやつ、座標、ロット、幅、高さ
	//=========================================================================
	void CreateOBBInfo(OBB_INFO* outOBB, D3DXVECTOR2* pos, float* rot, float* width, float* height);

};

#endif
//----EOF----