//=============================================================================
//
// CPlayerManagerクラス [CPlayerManager.h]
// Author : 佐藤　諒一
//
//=============================================================================
#ifndef __CPLAYERMANAGER_H__
#define __CPLAYERMANAGER_H__

//-----------------------------------------------------------------------------
// 前方宣言
//-----------------------------------------------------------------------------
class CPlayer;

//-----------------------------------------------------------------------------
// マクロ定義
//-----------------------------------------------------------------------------
// プレイヤーの最大数
#define MAXIMUM_NUMBER_OF_PLAYER 5

//-----------------------------------------------------------------------------
// プレイヤーマネージャクラス定義
//-----------------------------------------------------------------------------
class CPlayerManager
{
public:
	// コンストラクタ
	CPlayerManager();

	// デストラクタ
	~CPlayerManager();

	// 初期化
	void Init(int nNumPlayer);

	// 終了
	void Uninit(void);

	// 更新
	void Update(void);

private:
	// プレイヤーのポインタ格納用配列
	CPlayer* m_apPlayer[MAXIMUM_NUMBER_OF_PLAYER];
};

#endif //__CPLAYERMANAGER_H__

// EOF