//=============================================================================
//
// COptionクラス [COption.h]
// Author : 野尻　尚希
//
//=============================================================================
#ifndef _COPTION_H_
#define _COPTION_H_
//*****************************************************************************
// インクルード
//*****************************************************************************
#include "../../MAIN/main.h"
#include "../../PHASE/CPhase.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene2D;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class COption : public CPhase
{
public:
	// コンストラクタ
	COption(void);

	// デストラクタ
	~COption(void);

	//=================================================================
	// 初期化関数
	// 引数: シーンのモード, デバイス
	//=================================================================
	void Init(MODE_PHASE mode, LPDIRECT3DDEVICE9* pDevice);

	// 終了
	void Uninit(void);

	// 更新
	void Update(void);

	//=================================================================
	// クリエイト関数
	// 引数: シーンのモード, デバイス
	// 戻り値: このシーンのアドレス
	//=================================================================
	static COption* Create(MODE_PHASE mode, LPDIRECT3DDEVICE9* pDevice);

private:
	// モード
	typedef enum
	{
		OPTION_MODE_KEYCONFIG,
		OPTION_MODE_NEXT_SCENE,
		OPTION_MODE_MAX
	}OPTION_MODE;

	//=================================================================
	// キーコンフィグ関数
	//=================================================================
	void KeyConfig(void);


	OPTION_MODE					m_mode;
	CInputGamePad::PAD_BUTTON	m_setButton;		// 何のボタンか
	int							m_nControllerID;	// コントローラー番号
};

#endif
//----EOF----